Autodesk.Revit.DB.CitySet
An set that contains cities.

Autodesk.Revit.DB.CitySet.Insert(Autodesk.Revit.DB.City)
System.Int32
Insert the specified city into the set.
item: The city to be inserted into the set.
Returns: Returns whether the city was inserted into the set.

Autodesk.Revit.DB.CitySet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.CitySet.ReverseIterator
Autodesk.Revit.DB.CitySetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.CitySet.ForwardIterator
Autodesk.Revit.DB.CitySetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.CitySet.Erase(Autodesk.Revit.DB.City)
System.Int32
Removes a specified city from the set.
item: The city to be erased.
Returns: The number of cities that were erased from the set.

Autodesk.Revit.DB.CitySet.Contains(Autodesk.Revit.DB.City)
System.Boolean
Tests for the existence of a city within the set.
item: The city to be searched for.
Returns: The Contains method returns True if the city is within the set, otherwise False.

Autodesk.Revit.DB.CitySet.Clear
void
Removes every city from the set, rendering it empty.

Autodesk.Revit.DB.CitySet.Size
System.Int32
get
Returns the number of cities that are in the set.

Autodesk.Revit.DB.CitySet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.